FluidSolidInteraction/run/weakFsiFoam/beamInCrossFlow/fluid/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch interface;
solidZone interface-zone;

fluidPatch interface;
fluidZone interface-zone;

relaxationFactor 0.5;

// irrelevant parameters
interfaceDeformationLimit 0;

outerCorrTolerance 1e-6;
nOuterCorr 20;

interpolatorUpdateFrequency 0;

//couplingScheme FixedRelaxation;
couplingScheme Aitken;
// couplingScheme IQN-ILS;
couplingReuse 0;

coupled yes;
predictor yes;

// ************************************************************************* //
