FluidSolidInteraction/run/weakFsiFoam/beamInCrossFlow/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default         none;
//    div(phi,U)   Gauss linearUpwind cellLimited Gauss linear 1;
    div(phi,U)   Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(nu,U) Gauss linear skewCorrected 1;
    laplacian((1|A(U)),p) Gauss linear skewCorrected 1;
    laplacian(diffusivity,cellMotionU) Gauss linear skewCorrected 1;
}

interpolationSchemes
{
    default linear;
    interpolate(y) linear;
    interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default         skewCorrected 1;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
